Revit 2027 API
FluidType.ClearAllTemperatures Method
 Clears all fluid temperatures in the set.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ClearAllTemperatures()
Public Sub ClearAllTemperatures
public:
void ClearAllTemperatures()
member ClearAllTemperatures : unit -> unit
Exceptions
Exception | Condition
ArgumentException |  Thrown if some temperatures in the FluidType object are in use.
See Also
Reference
FluidType Class
Autodesk.Revit.DB.Plumbing Namespace